In [1]:
import os
import re
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import json
import urllib
import requests

In [2]:
columns_name=['user_id','item_id','rating','timestamp']
main_data_df=pd.read_csv("/Users/chipampe/Desktop/ETL_Project/Data user details/users data/ml-100k/u.data", sep="\t",names=columns_name)        

main_data_df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [3]:
#just items list 
itemdf = pd.DataFrame(main_data_df.item_id)
itemdf

       item_id
0          242
1          302
2          377
3           51
4          346
...        ...
99995      476
99996      204
99997     1090
99998      225
99999      203

[100000 rows x 1 columns]

In [4]:
movie_cols =['movie_id','movie_name']
movies = pd.read_csv('/Users/chipampe/Desktop/ETL_Project/Data user details/users data/ml-100k/u.item',sep = '\|',header = None,usecols=[0,1],names = movie_cols)
movies

/Users/chipampe/opt/anaconda3/envs/Pythondata/lib/python3.6/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

      movie_id                                 movie_name
0            1                           Toy Story (1995)
1            2                           GoldenEye (1995)
2            3                          Four Rooms (1995)
3            4                          Get Shorty (1995)
4            5                             Copycat (1995)
...        ...                                        ...
1677      1678                          Mat' i syn (1997)
1678      1679                           B. Monkey (1998)
1679      1680                       Sliding Doors (1998)
1680      1681                        You So Crazy (1994)
1681      1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [5]:
movie_iddf = pd.DataFrame(movies.movie_id)
movie_iddf

      movie_id
0            1
1            2
2            3
3            4
4            5
...        ...
1677      1678
1678      1679
1679      1680
1680      1681
1681      1682

[1682 rows x 1 columns]

In [6]:
results = movies['movie_name'] = movies['movie_name'].str.replace('\d+', '')
results

0                                Toy Story ()
1                                GoldenEye ()
2                               Four Rooms ()
3                               Get Shorty ()
4                                  Copycat ()
                        ...
1677                            Mat' i syn ()
1678                             B. Monkey ()
1679                         Sliding Doors ()
1680                          You So Crazy ()
1681    Scream of Stone (Schrei aus Stein) ()
Name: movie_name, Length: 1682, dtype: object

In [7]:
resultsdf = pd.DataFrame(results)
resultsdf

                                 movie_name
0                              Toy Story ()
1                              GoldenEye ()
2                             Four Rooms ()
3                             Get Shorty ()
4                                Copycat ()
...                                     ...
1677                          Mat' i syn ()
1678                           B. Monkey ()
1679                       Sliding Doors ()
1680                        You So Crazy ()
1681  Scream of Stone (Schrei aus Stein) ()

[1682 rows x 1 columns]

In [8]:
finalresults = resultsdf['movie_name'] = resultsdf['movie_name'].apply(lambda x: x.replace('(','').replace(')','')) 
moviesdata = pd.DataFrame(finalresults)
moviesdata

                             movie_name
0                            Toy Story
1                            GoldenEye
2                           Four Rooms
3                           Get Shorty
4                              Copycat
...                                 ...
1677                        Mat' i syn
1678                         B. Monkey
1679                     Sliding Doors
1680                      You So Crazy
1681  Scream of Stone Schrei aus Stein

[1682 rows x 1 columns]

In [9]:
new_movie_data = pd.concat([moviesdata, movie_iddf], axis=1)
new_movie_data2 = new_movie_data.set_index('movie_id')
new_movie_data2.head()

           movie_name
movie_id
1          Toy Story
2          GoldenEye
3         Four Rooms
4         Get Shorty
5            Copycat

In [10]:
movie_data = new_movie_data2

movie_data

                                 movie_name
movie_id
1                                Toy Story
2                                GoldenEye
3                               Four Rooms
4                               Get Shorty
5                                  Copycat
...                                     ...
1678                            Mat' i syn
1679                             B. Monkey
1680                         Sliding Doors
1681                          You So Crazy
1682      Scream of Stone Schrei aus Stein

[1682 rows x 1 columns]

In [11]:
movies = movie_data.to_csv('movies.csv')